bigtreetech/BIGTREETECH-OCTOPUS-V1.0/Firmware/RepRapFirmware/RRFBuild-SourceCode/CoreN2G/src/atmel/SAMC21_DFP/1.2.176/samc21/svd/ATSAMC21E15A.svd
            <register>
               <name>RXF1C</name>
               <description>Rx FIFO 1 Configuration</description>
               <addressOffset>0xB0</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>F1SA</name>
                     <description>Rx FIFO 1 Start Address</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
                  <field>
                     <name>F1S</name>
                     <description>Rx FIFO 1 Size</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>7</bitWidth>
                  </field>
                  <field>
                     <name>F1WM</name>
                     <description>Rx FIFO 1 Watermark</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>7</bitWidth>
                  </field>
                  <field>
                     <name>F1OM</name>
                     <description>FIFO 1 Operation Mode</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>RXF1S</name>
               <description>Rx FIFO 1 Status</description>
               <addressOffset>0xB4</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>F1FL</name>
                     <description>Rx FIFO 1 Fill Level</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>7</bitWidth>
                  </field>
                  <field>
                     <name>F1GI</name>
                     <description>Rx FIFO 1 Get Index</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>6</bitWidth>
                  </field>
                  <field>
                     <name>F1PI</name>
                     <description>Rx FIFO 1 Put Index</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>6</bitWidth>
                  </field>
                  <field>
                     <name>F1F</name>
                     <description>Rx FIFO 1 Full</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RF1L</name>
                     <description>Rx FIFO 1 Message Lost</description>
                     <bitOffset>25</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DMS</name>
                     <description>Debug Message Status</description>
                     <bitOffset>30</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <name>DMSSelect</name>
                        <enumeratedValue>
                           <name>IDLE</name>
                           <description>Idle state</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DBGA</name>
                           <description>Debug message A received</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DBGB</name>
                           <description>Debug message A/B received</description>
                           <value>2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DBGC</name>
                           <description>Debug message A/B/C received, DMA request set</description>
                           <value>3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>RXF1A</name>
               <description>Rx FIFO 1 Acknowledge</description>
               <addressOffset>0xB8</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>F1AI</name>
                     <description>Rx FIFO 1 Acknowledge Index</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>6</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>RXESC</name>
               <description>Rx Buffer / FIFO Element Size Configuration</description>
               <addressOffset>0xBC</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>F0DS</name>
                     <description>Rx FIFO 0 Data Field Size</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>3</bitWidth>
                     <enumeratedValues>
                        <name>F0DSSelect</name>
                        <enumeratedValue>
                           <name>DATA8</name>
                           <description>8 byte data field</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DATA12</name>
                           <description>12 byte data field</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DATA16</name>
                           <description>16 byte data field</description>
                           <value>2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DATA20</name>
                           <description>20 byte data field</description>
                           <value>3</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DATA24</name>
                           <description>24 byte data field</description>
                           <value>4</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DATA32</name>
                           <description>32 byte data field</description>
                           <value>5</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DATA48</name>
                           <description>48 byte data field</description>
                           <value>6</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DATA64</name>
                           <description>64 byte data field</description>
                           <value>7</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>F1DS</name>
                     <description>Rx FIFO 1 Data Field Size</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>3</bitWidth>
                     <enumeratedValues>
                        <name>F1DSSelect</name>
                        <enumeratedValue>
                           <name>DATA8</name>
                           <description>8 byte data field</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DATA12</name>
                           <description>12 byte data field</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DATA16</name>
                           <description>16 byte data field</description>
                           <value>2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DATA20</name>
                           <description>20 byte data field</description>
                           <value>3</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DATA24</name>
                           <description>24 byte data field</description>
                           <value>4</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DATA32</name>
                           <description>32 byte data field</description>
                           <value>5</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DATA48</name>
                           <description>48 byte data field</description>
                           <value>6</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DATA64</name>
                           <description>64 byte data field</description>
                           <value>7</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>RBDS</name>
                     <description>Rx Buffer Data Field Size</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>3</bitWidth>
                     <enumeratedValues>
                        <name>RBDSSelect</name>
                        <enumeratedValue>
                           <name>DATA8</name>
                           <description>8 byte data field</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DATA12</name>
                           <description>12 byte data field</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DATA16</name>
                           <description>16 byte data field</description>
                           <value>2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DATA20</name>
                           <description>20 byte data field</description>
                           <value>3</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DATA24</name>
                           <description>24 byte data field</description>
                           <value>4</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DATA32</name>
                           <description>32 byte data field</description>
                           <value>5</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DATA48</name>
                           <description>48 byte data field</description>
                           <value>6</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DATA64</name>
                           <description>64 byte data field</description>
                           <value>7</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>TXBC</name>
               <description>Tx Buffer Configuration</description>
               <addressOffset>0xC0</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>TBSA</name>
                     <description>Tx Buffers Start Address</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
                  <field>
                     <name>NDTB</name>
                     <description>Number of Dedicated Transmit Buffers</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>6</bitWidth>
                  </field>
                  <field>
                     <name>TFQS</name>
                     <description>Transmit FIFO/Queue Size</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>6</bitWidth>
                  </field>
                  <field>
                     <name>TFQM</name>
                     <description>Tx FIFO/Queue Mode</description>
                     <bitOffset>30</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>TXFQS</name>
               <description>Tx FIFO / Queue Status</description>
               <addressOffset>0xC4</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>TFFL</name>
                     <description>Tx FIFO Free Level</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>6</bitWidth>
                  </field>
                  <field>
                     <name>TFGI</name>
                     <description>Tx FIFO Get Index</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
                  <field>
                     <name>TFQPI</name>
                     <description>Tx FIFO/Queue Put Index</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
                  <field>
                     <name>TFQF</name>
                     <description>Tx FIFO/Queue Full</description>
                     <bitOffset>21</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>TXESC</name>
               <description>Tx Buffer Element Size Configuration</description>
               <addressOffset>0xC8</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>TBDS</name>
                     <description>Tx Buffer Data Field Size</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>3</bitWidth>
                     <enumeratedValues>
                        <name>TBDSSelect</name>
                        <enumeratedValue>
                           <name>DATA8</name>
                           <description>8 byte data field</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DATA12</name>
                           <description>12 byte data field</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DATA16</name>
                           <description>16 byte data field</description>
                           <value>2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DATA20</name>
                           <description>20 byte data field</description>
                           <value>3</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DATA24</name>
                           <description>24 byte data field</description>
                           <value>4</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DATA32</name>
                           <description>32 byte data field</description>
                           <value>5</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DATA48</name>
                           <description>48 byte data field</description>
                           <value>6</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DATA64</name>
                           <description>64 byte data field</description>
                           <value>7</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
